app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-01-02 23:54:43.657856"], ["id", 1]]
---
  def update
    @class = SchoolClass.find(params[:id])
    @class.update(class_params(:title, :room_number))

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-01-02 11:37:59.893980"], ["updated_at", "2018-01-02 11:37:59.893980"]]
---
  def create
    @class = SchoolClass.new(class_params(:title,:room_number))
	  @class.save